Revit 2027 API
XYZ.Add Method
Adds the specified vector to this vector and returns the result.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public XYZ Add(
	XYZ source
)
Public Function Add (
	source As XYZ
) As XYZ
public:
XYZ^ Add(
	XYZ^ source
)
member Add :
        source : XYZ -> XYZ
Parameters
source XYZ
The vector to add to this vector.
Return Value
XYZ
The vector equal to the sum of the two vectors.
Exceptions
Exception | Condition
ArgumentNullException |  Thrown when source is null.
Remarks
 The added vector is obtained by adding each coordinate of the specified vector to the corresponding coordinate of this vector.
See Also
Reference
XYZ Class
Autodesk.Revit.DB Namespace